org/post/2015-01-13-Android-Test.org
#+OPTIONS: ^:nil
#+OPTIONS: toc:nil
#+AUTHOR: Luis404
#+EMAIL: luisxu404@gmail.com

#+BEGIN_HTML
---
layout: post
title: Android Test
tag: [Android, Test, TBD]
description: [This acticle is about the common Android Test Frameworks]
---
#+END_HTML

* 1. Use default android test framework
** 1.1 ApplicationTestCase
1. Test class definition:

   #+BEGIN_SRC java
"public class ApplicationTest extends ApplicationTestCase<LauncherApplication>";
   #+END_SRC

2. trigger application create: createApplication;
3. get the test application: getApplication();
4. Every test function is separated, so may be should call getApplication() many times;

** 1.2 Activity test
1. class extends to ActivityInstrumentationTestCase2<T>.
2. Use getActivity() to trigger the onCreate(); Use activity.finish() and setActivity(null) 
   to destroy the activity;
3. How to get context: 

 #+BEGIN_SRC java
getInstrumentation.getTargetContext().getApplicationContext();
 #+END_SRC

* 2 MonkeyRunner
* 3. Robelectric
