_posts/2015-01-13-Android-Test.html
---
layout: post
title: Android Test
tag: [Android, Test, TBD]
description: [This acticle is about the common Android Test Frameworks]
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 1. Use default android test framework</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 1.1 ApplicationTestCase</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li>Test class definition:

<div class="org-src-container">

<pre class="src src-java">"public class ApplicationTest extends ApplicationTestCase&lt;LauncherApplication&gt;";
</pre>
</div>
</li>

<li>trigger application create: createApplication;
</li>
<li>get the test application: getApplication();
</li>
<li>Every test function is separated, so may be should call getApplication() many times;
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 1.2 Activity test</h3>
<div class="outline-text-3" id="text-1-2">
<ol class="org-ol">
<li>class extends to ActivityInstrumentationTestCase2&lt;T&gt;.
</li>
<li>Use getActivity() to trigger the onCreate(); Use activity.finish() and setActivity(null) 
to destroy the activity;
</li>
<li>How to get context: 

<div class="org-src-container">

<pre class="src src-java">getInstrumentation.getTargetContext().getApplicationContext();
</pre>
</div>
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 2 MonkeyRunner</h2>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 3. Robelectric</h2>
</div>
